currency-api/stress_test.yml
config:
  target: 'http://localhost:3000' # URL base API
  phases:
    - duration: 60 # Duração do teste em segundos
      arrivalRate: 1000 # Quantidade de requisições por segundo
      name: Stress test phase      

scenarios:
  - flow:
      - get:
          url: "/currencies" # Endpoint de teste